In [515]:
import pandas as pd
import numpy as np

In [516]:
#korean is encoded in utf-8
cctv_seoul = pd.read_csv('01.CCTV_in_Seoul.csv', encoding='utf-8')
#shows the first 5 rows
cctv_seoul.head()

   기관명    소계  2013년도 이전  2014년  2015년  2016년
0  강남구  2780       1292    430    584    932
1  강동구   773        379     99    155    377
2  강북구   748        369    120    138    204
3  강서구   884        388    258    184     81
4  관악구  1496        846    260    390    613

In [517]:
#returns the columns in the csv file loaded
cctv_seoul.columns[0]

'기관명'

In [518]:
#this renames the first column to '구별'. inplace=True means to apply the changes
cctv_seoul.rename(columns={cctv_seoul.columns[0]: '구별'}, inplace=True)
cctv_seoul.columns

Index(['구별', '소계', '2013년도 이전', '2014년', '2015년', '2016년'], dtype='object')

In [519]:
cctv_seoul.head()

    구별    소계  2013년도 이전  2014년  2015년  2016년
0  강남구  2780       1292    430    584    932
1  강동구   773        379     99    155    377
2  강북구   748        369    120    138    204
3  강서구   884        388    258    184     81
4  관악구  1496        846    260    390    613

In [520]:
pop_seoul = pd.read_excel('01.population_in_Seoul.xls')
pop_seoul

,기간,자치구,세대,인구,인구.1,인구.2,인구.3,인구.4,인구.5,인구.6,인구.7,인구.8,세대당인구,65세이상고령자
0,기간,자치구,세대,합계,합계,합계,한국인,한국인,한국인,등록외국인,등록외국인,등록외국인,세대당인구,65세이상고령자
1,기간,자치구,세대,계,남자,여자,계,남자,여자,계,남자,여자,세대당인구,65세이상고령자
2,2017.1/4,합계,4202888,10197604,5000005,5197599,9926968,4871560,5055408,270636,128445,142191,2.36,1321458
3,2017.1/4,종로구,72654,162820,79675,83145,153589,75611,77978,9231,4064,5167,2.11,25425
4,2017.1/4,중구,59481,133240,65790,67450,124312,61656,62656,8928,4134,4794,2.09,20764
5,2017.1/4,용산구,106544,244203,119132,125071,229456,111167,118289,14747,7965,6782,2.15,36231
6,2017.1/4,성동구,130868,311244,153768,157476,303380,150076,153304,7864,3692,4172,2.32,39997
7,2017.1/4,광진구,158960,372164,180992,191172,357211,174599,182612,14953,6393,8560,2.25,42214
8,2017.1/4,동대문구,159839,369496,182932,186564,354079,177021,177058,15417,5911,9506,2.22,54173
9,2017.1/4,중랑구,177548,414503,206102,208401,409882,204265,205617,4621,1837,2784,2.31,56774
10,2017.1/4,성북구,188512,461260,224076,237184,449773,219545,230228,11487,4531,6956,2.39,64692
11,2017.1/4,강북구,141554,330192,161686,168506,326686,160353,166333,3506,1333,2173,2.31,54813
12,2017.1/4,도봉구,136613,348646,171026,177620,346629,170289,176340,2017,737,1280,2.54,51312
13,2017.1/4,노원구,219957,569384,276823,292561,565565,275211,290354,3819,1612,2207,2.57,71941
14,2017.1/4,은평구,201869,494388,240220,254168,489943,238337,251606,4445,1883,2562,2.43,72334
15,2017.1/4,서대문구,137207,327163,156765,170398,314982,152613,162369,12181,4152,8029,2.3,48161
16,2017.1/4,마포구,169404,389649,185889,203760,378566,181346,197220,11083,4543,6540,2.23,48765
17,2017.1/4,양천구,176921,479978,237117,242861,475949,235278,240671,4029,1839,2190,2.69,52975
18,2017.1/4,강서구,247696,603772,294433,309339,597248,291249,305999,6524,3184,3340,2.41,72548
19,2017.1/4,구로구,172272,447874,224436,223438,416487,207114,209373,31387,17322,14065,2.42,56833
20,2017.1/4,금천구,105146,255082,130558,124524,236353,120334,116019,18729,10224,8505,2.25,32970
21,2017.1/4,영등포구,165462,402985,202573,200412,368072,183705,184367,34913,18868,16045,2.22,52413
22,2017.1/4,동작구,173033,412520,201217,211303,400456,195775,204681,12064,5442,6622,2.31,56013
23,2017.1/4,관악구,253826,525515,264763,260752,507203,256090,251113,18312,8673,9639,2,68082
24,2017.1/4,서초구,173856,450310,216264,234046,445994,214036,231958,4316,2228,2088,2.57,51733
25,2017.1/4,강남구,234107,570500,273301,297199,565550,270726,294824,4950,2575,2375,2.42,63167
26,2017.1/4,송파구,259883,667483,325040,342443,660584,321676,338908,6899,3364,3535,2.54,72506
27,2017.1/4,강동구,179676,453233,225427,227806,449019,223488,225531,4214,1939,2275,2.5,54622
28,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [521]:
#header=2 means read from the second row, parse_cols means read the specified columns only
pop_seoul = pd.read_excel('01.population_in_Seoul.xls', 
                          header = 2,
                          parse_cols = 'B, D, G, J, N',
                          encoding='utf-8')

/Users/jonghobaeck/miniconda3/lib/python3.7/site-packages/ipykernel_launcher.py:5: FutureWarning: the 'parse_cols' keyword is deprecated, use 'usecols' instead
  """

In [522]:
pop_seoul.head()

   자치구           계        계.1       계.2   65세이상고령자
0   합계  10197604.0  9926968.0  270636.0  1321458.0
1  종로구    162820.0   153589.0    9231.0    25425.0
2   중구    133240.0   124312.0    8928.0    20764.0
3  용산구    244203.0   229456.0   14747.0    36231.0
4  성동구    311244.0   303380.0    7864.0    39997.0

In [523]:
#see the columns
pop_seoul.columns

Index(['자치구', '계', '계.1', '계.2', '65세이상고령자'], dtype='object')

In [524]:
#however, these changes don't change the text in the original file, because we made an instanceo out of the file
pop_seoul.rename(columns={pop_seoul.columns[0]:'구별',
                          pop_seoul.columns[1]:'인구수',
                          pop_seoul.columns[2]:'한국인',
                          pop_seoul.columns[3]:'외국인',
                          pop_seoul.columns[4]:'고령자'}, inplace=True)
pop_seoul.head()

    구별         인구수        한국인       외국인        고령자
0   합계  10197604.0  9926968.0  270636.0  1321458.0
1  종로구    162820.0   153589.0    9231.0    25425.0
2   중구    133240.0   124312.0    8928.0    20764.0
3  용산구    244203.0   229456.0   14747.0    36231.0
4  성동구    311244.0   303380.0    7864.0    39997.0

In [525]:
pop_seoul.values

array([['합계', 10197604.0, 9926968.0, 270636.0, 1321458.0],
       ['종로구', 162820.0, 153589.0, 9231.0, 25425.0],
       ['중구', 133240.0, 124312.0, 8928.0, 20764.0],
       ['용산구', 244203.0, 229456.0, 14747.0, 36231.0],
       ['성동구', 311244.0, 303380.0, 7864.0, 39997.0],
       ['광진구', 372164.0, 357211.0, 14953.0, 42214.0],
       ['동대문구', 369496.0, 354079.0, 15417.0, 54173.0],
       ['중랑구', 414503.0, 409882.0, 4621.0, 56774.0],
       ['성북구', 461260.0, 449773.0, 11487.0, 64692.0],
       ['강북구', 330192.0, 326686.0, 3506.0, 54813.0],
       ['도봉구', 348646.0, 346629.0, 2017.0, 51312.0],
       ['노원구', 569384.0, 565565.0, 3819.0, 71941.0],
       ['은평구', 494388.0, 489943.0, 4445.0, 72334.0],
       ['서대문구', 327163.0, 314982.0, 12181.0, 48161.0],
       ['마포구', 389649.0, 378566.0, 11083.0, 48765.0],
       ['양천구', 479978.0, 475949.0, 4029.0, 52975.0],
       ['강서구', 603772.0, 597248.0, 6524.0, 72548.0],
       ['구로구', 447874.0, 416487.0, 31387.0, 56833.0],
       ['금천구', 255082.0, 236353.0, 18729.0, 32970.0],
       ['영등포구', 402985.0, 368072.0, 34913.0, 52413.0],
       ['동작구', 412520.0, 400456.0, 12064.0, 56013.0],
       ['관악구', 525515.0, 507203.0, 18312.0, 68082.0],
       ['서초구', 450310.0, 445994.0, 4316.0, 51733.0],
       ['강남구', 570500.0, 565550.0, 4950.0, 63167.0],
       ['송파구', 667483.0, 660584.0, 6899.0, 72506.0],
       ['강동구', 453233.0, 449019.0, 4214.0, 54622.0],
       [nan, nan, nan, nan, nan]], dtype=object)

# A Bit Into Numpy

In [526]:
#nan means Not A Number
s = pd.Series([1,3,5,np.nan,6,8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [527]:
#you can set the basic dates, and use 'periods' to set the ranges
dates = pd.date_range('20130101', periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [528]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=['A','B','C','D'])
df

                   A         B         C         D
2013-01-01 -0.783390  1.087647  0.731889  1.994064
2013-01-02  0.307259 -0.191487 -0.103452  1.664466
2013-01-03 -0.968419  1.737610 -0.350811 -0.157417
2013-01-04 -0.546377 -2.003073  0.810058 -0.077003
2013-01-05  0.825257 -0.679746 -0.399147  0.189665
2013-01-06 -0.734640  0.209063 -1.561158  0.179590

In [529]:
#this orders the dataframe by given data.
df.sort_values(by='B', ascending=False)

                   A         B         C         D
2013-01-03 -0.968419  1.737610 -0.350811 -0.157417
2013-01-01 -0.783390  1.087647  0.731889  1.994064
2013-01-06 -0.734640  0.209063 -1.561158  0.179590
2013-01-02  0.307259 -0.191487 -0.103452  1.664466
2013-01-05  0.825257 -0.679746 -0.399147  0.189665
2013-01-04 -0.546377 -2.003073  0.810058 -0.077003

In [530]:
#shows results in column C df['C']
df[['C', 'D']]

                   C         D
2013-01-01  0.731889  1.994064
2013-01-02 -0.103452  1.664466
2013-01-03 -0.350811 -0.157417
2013-01-04  0.810058 -0.077003
2013-01-05 -0.399147  0.189665
2013-01-06 -1.561158  0.179590

In [531]:
#you can select return specific rows as well
df[0:3]

                   A         B         C         D
2013-01-01 -0.783390  1.087647  0.731889  1.994064
2013-01-02  0.307259 -0.191487 -0.103452  1.664466
2013-01-03 -0.968419  1.737610 -0.350811 -0.157417

In [532]:
#or you can do this
df['2013-01-02':'20130104']

                   A         B         C         D
2013-01-02  0.307259 -0.191487 -0.103452  1.664466
2013-01-03 -0.968419  1.737610 -0.350811 -0.157417
2013-01-04 -0.546377 -2.003073  0.810058 -0.077003

In [533]:
#loc is a slicing option
df.loc[dates[0:2]]

                   A         B         C         D
2013-01-01 -0.783390  1.087647  0.731889  1.994064
2013-01-02  0.307259 -0.191487 -0.103452  1.664466

In [534]:
df.loc[:, ['A', 'B']]
df.loc['20130102':'20130104', ['A', 'B']]

                   A         B
2013-01-02  0.307259 -0.191487
2013-01-03 -0.968419  1.737610
2013-01-04 -0.546377 -2.003073

In [535]:
df.loc['20130102', ['A', 'B']]

A    0.307259
B   -0.191487
Name: 2013-01-02 00:00:00, dtype: float64

In [536]:
df

                   A         B         C         D
2013-01-01 -0.783390  1.087647  0.731889  1.994064
2013-01-02  0.307259 -0.191487 -0.103452  1.664466
2013-01-03 -0.968419  1.737610 -0.350811 -0.157417
2013-01-04 -0.546377 -2.003073  0.810058 -0.077003
2013-01-05  0.825257 -0.679746 -0.399147  0.189665
2013-01-06 -0.734640  0.209063 -1.561158  0.179590

## Using iloc

In [537]:
#using only number in iloc returns the specified row
df.iloc[3]

A   -0.546377
B   -2.003073
C    0.810058
D   -0.077003
Name: 2013-01-04 00:00:00, dtype: float64

In [538]:
#the first bracket refers to row specification, and the second bracket refers to the column specification
df.iloc[3:5, 0:2]

                   A         B
2013-01-04 -0.546377 -2.003073
2013-01-05  0.825257 -0.679746

In [539]:
df.iloc[[1,2,4],[0,2]]

                   A         C
2013-01-02  0.307259 -0.103452
2013-01-03 -0.968419 -0.350811
2013-01-05  0.825257 -0.399147

In [540]:
# :refers to whole
df.iloc[1:3, :]

                   A         B         C         D
2013-01-02  0.307259 -0.191487 -0.103452  1.664466
2013-01-03 -0.968419  1.737610 -0.350811 -0.157417

In [541]:
#this shows all the values in column A
df['A']

2013-01-01   -0.783390
2013-01-02    0.307259
2013-01-03   -0.968419
2013-01-04   -0.546377
2013-01-05    0.825257
2013-01-06   -0.734640
Freq: D, Name: A, dtype: float64

In [542]:
#this retrieves all values of dates whose values in A is greater than 0
df[df.A > 0]

                   A         B         C         D
2013-01-02  0.307259 -0.191487 -0.103452  1.664466
2013-01-05  0.825257 -0.679746 -0.399147  0.189665

In [543]:
# this retrieves all data for which the values are greater than 0.
# if not greater than 0, they will be given NaN.
df[df > 0]

                   A         B         C         D
2013-01-01       NaN  1.087647  0.731889  1.994064
2013-01-02  0.307259       NaN       NaN  1.664466
2013-01-03       NaN  1.737610       NaN       NaN
2013-01-04       NaN       NaN  0.810058       NaN
2013-01-05  0.825257       NaN       NaN  0.189665
2013-01-06       NaN  0.209063       NaN  0.179590

In [544]:
#copy method
df2 = df.copy()

In [545]:
# Adding a new column to the DataFrame
df2['E'] = ['one', 'one', 'two', 'three', 'four', 'three']
df2

                   A         B         C         D      E
2013-01-01 -0.783390  1.087647  0.731889  1.994064    one
2013-01-02  0.307259 -0.191487 -0.103452  1.664466    one
2013-01-03 -0.968419  1.737610 -0.350811 -0.157417    two
2013-01-04 -0.546377 -2.003073  0.810058 -0.077003  three
2013-01-05  0.825257 -0.679746 -0.399147  0.189665   four
2013-01-06 -0.734640  0.209063 -1.561158  0.179590  three

In [546]:
#check if two or four are in the E column
df2['E'].isin(['two', 'four'])

2013-01-01    False
2013-01-02    False
2013-01-03     True
2013-01-04    False
2013-01-05     True
2013-01-06    False
Freq: D, Name: E, dtype: bool

In [547]:
df2[df2['E'].isin(['two', 'four'])]

                   A         B         C         D     E
2013-01-03 -0.968419  1.737610 -0.350811 -0.157417   two
2013-01-05  0.825257 -0.679746 -0.399147  0.189665  four

In [548]:
#Adding column E in df2 doesn't affect the original df
df

                   A         B         C         D
2013-01-01 -0.783390  1.087647  0.731889  1.994064
2013-01-02  0.307259 -0.191487 -0.103452  1.664466
2013-01-03 -0.968419  1.737610 -0.350811 -0.157417
2013-01-04 -0.546377 -2.003073  0.810058 -0.077003
2013-01-05  0.825257 -0.679746 -0.399147  0.189665
2013-01-06 -0.734640  0.209063 -1.561158  0.179590

In [549]:
#use cumsum from numpy to see cumulative data
df.apply(np.cumsum)

                   A         B         C         D
2013-01-01 -0.783390  1.087647  0.731889  1.994064
2013-01-02 -0.476131  0.896160  0.628437  3.658531
2013-01-03 -1.444550  2.633770  0.277626  3.501113
2013-01-04 -1.990926  0.630698  1.087684  3.424111
2013-01-05 -1.165669 -0.049049  0.688537  3.613776
2013-01-06 -1.900309  0.160015 -0.872621  3.793366

In [550]:
df.apply(lambda x: x.max() - x.min())

A    1.793676
B    3.740683
C    2.371216
D    2.151481
dtype: float64

In [551]:
cctv_seoul.head()

    구별    소계  2013년도 이전  2014년  2015년  2016년
0  강남구  2780       1292    430    584    932
1  강동구   773        379     99    155    377
2  강북구   748        369    120    138    204
3  강서구   884        388    258    184     81
4  관악구  1496        846    260    390    613

In [552]:
cctv_seoul.sort_values(by='소계', ascending=True).head(5)

     구별   소계  2013년도 이전  2014년  2015년  2016년
9   도봉구  485        238    159     42    386
12  마포구  574        314    118    169    379
17  송파구  618        529     21     68    463
24  중랑구  660        509    121    177    109
23   중구  671        413    190     72    348

In [553]:
type(df.A)

pandas.core.series.Series

In [554]:
cctv_seoul.head(5)

    구별    소계  2013년도 이전  2014년  2015년  2016년
0  강남구  2780       1292    430    584    932
1  강동구   773        379     99    155    377
2  강북구   748        369    120    138    204
3  강서구   884        388    258    184     81
4  관악구  1496        846    260    390    613

In [555]:
cctv_seoul['최근증가율'] = (cctv_seoul['2016년']+cctv_seoul['2015년']+cctv_seoul['2014년']) \
                        / cctv_seoul['2013년도 이전'] * 100

In [556]:
cctv_seoul.sort_values(by='최근증가율', ascending=False).head(5)

     구별    소계  2013년도 이전  2014년  2015년  2016년       최근증가율
22  종로구  1002        464    314    211    630  248.922414
9   도봉구   485        238    159     42    386  246.638655
12  마포구   574        314    118    169    379  212.101911
8   노원구  1265        542     57    451    516  188.929889
1   강동구   773        379     99    155    377  166.490765

In [557]:
pop_seoul.head()

    구별         인구수        한국인       외국인        고령자
0   합계  10197604.0  9926968.0  270636.0  1321458.0
1  종로구    162820.0   153589.0    9231.0    25425.0
2   중구    133240.0   124312.0    8928.0    20764.0
3  용산구    244203.0   229456.0   14747.0    36231.0
4  성동구    311244.0   303380.0    7864.0    39997.0

In [558]:
# drop the first row in pop_seoul 
pop_seoul.drop([0], inplace=True)
pop_seoul.head()

    구별       인구수       한국인      외국인      고령자
1  종로구  162820.0  153589.0   9231.0  25425.0
2   중구  133240.0  124312.0   8928.0  20764.0
3  용산구  244203.0  229456.0  14747.0  36231.0
4  성동구  311244.0  303380.0   7864.0  39997.0
5  광진구  372164.0  357211.0  14953.0  42214.0

In [559]:
#find unique values in 구별
pop_seoul['구별'].unique()

array(['종로구', '중구', '용산구', '성동구', '광진구', '동대문구', '중랑구', '성북구', '강북구',
       '도봉구', '노원구', '은평구', '서대문구', '마포구', '양천구', '강서구', '구로구', '금천구',
       '영등포구', '동작구', '관악구', '서초구', '강남구', '송파구', '강동구', nan],
      dtype=object)

In [560]:
#find index of the null value
pop_seoul[pop_seoul['구별'].isnull()]

     구별  인구수  한국인  외국인  고령자
26  NaN  NaN  NaN  NaN  NaN

In [561]:
#drop null value
pop_seoul.drop([26], inplace=True)
pop_seoul.head()

    구별       인구수       한국인      외국인      고령자
1  종로구  162820.0  153589.0   9231.0  25425.0
2   중구  133240.0  124312.0   8928.0  20764.0
3  용산구  244203.0  229456.0  14747.0  36231.0
4  성동구  311244.0  303380.0   7864.0  39997.0
5  광진구  372164.0  357211.0  14953.0  42214.0

In [562]:
# adding a new column for foreigner ratio and aged-population ratio
pop_seoul['외국인비율'] = pop_seoul['외국인'] / pop_seoul['인구수'] * 100
pop_seoul['고령자비율'] = pop_seoul['고령자'] / pop_seoul['인구수'] * 100
pop_seoul.head()

    구별       인구수       한국인      외국인      고령자     외국인비율      고령자비율
1  종로구  162820.0  153589.0   9231.0  25425.0  5.669451  15.615404
2   중구  133240.0  124312.0   8928.0  20764.0  6.700690  15.583909
3  용산구  244203.0  229456.0  14747.0  36231.0  6.038828  14.836427
4  성동구  311244.0  303380.0   7864.0  39997.0  2.526635  12.850689
5  광진구  372164.0  357211.0  14953.0  42214.0  4.017852  11.342849

In [563]:
# sort by 인구수
pop_seoul.sort_values(by='인구수', ascending=False).head()

     구별       인구수       한국인      외국인      고령자     외국인비율      고령자비율
24  송파구  667483.0  660584.0   6899.0  72506.0  1.033584  10.862599
16  강서구  603772.0  597248.0   6524.0  72548.0  1.080540  12.015794
23  강남구  570500.0  565550.0   4950.0  63167.0  0.867660  11.072217
11  노원구  569384.0  565565.0   3819.0  71941.0  0.670725  12.634883
21  관악구  525515.0  507203.0  18312.0  68082.0  3.484582  12.955291

In [564]:
# sort by number of foreigners
pop_seoul.sort_values(by='외국인', ascending=False).head()

      구별       인구수       한국인      외국인      고령자     외국인비율      고령자비율
19  영등포구  402985.0  368072.0  34913.0  52413.0  8.663598  13.006191
17   구로구  447874.0  416487.0  31387.0  56833.0  7.007998  12.689506
18   금천구  255082.0  236353.0  18729.0  32970.0  7.342345  12.925255
21   관악구  525515.0  507203.0  18312.0  68082.0  3.484582  12.955291
6   동대문구  369496.0  354079.0  15417.0  54173.0  4.172440  14.661322

In [565]:
# sort by foreigner ratio
pop_seoul.sort_values(by='외국인비율', ascending=False).head()

      구별       인구수       한국인      외국인      고령자     외국인비율      고령자비율
19  영등포구  402985.0  368072.0  34913.0  52413.0  8.663598  13.006191
18   금천구  255082.0  236353.0  18729.0  32970.0  7.342345  12.925255
17   구로구  447874.0  416487.0  31387.0  56833.0  7.007998  12.689506
2     중구  133240.0  124312.0   8928.0  20764.0  6.700690  15.583909
3    용산구  244203.0  229456.0  14747.0  36231.0  6.038828  14.836427

In [566]:
# sort by over-aged
pop_seoul.sort_values(by='고령자', ascending=False).head()

     구별       인구수       한국인      외국인      고령자     외국인비율      고령자비율
16  강서구  603772.0  597248.0   6524.0  72548.0  1.080540  12.015794
24  송파구  667483.0  660584.0   6899.0  72506.0  1.033584  10.862599
12  은평구  494388.0  489943.0   4445.0  72334.0  0.899091  14.631019
11  노원구  569384.0  565565.0   3819.0  71941.0  0.670725  12.634883
21  관악구  525515.0  507203.0  18312.0  68082.0  3.484582  12.955291

In [567]:
# sort by over-aged ratio
pop_seoul.sort_values(by='고령자비율', ascending=False).head()

      구별       인구수       한국인      외국인      고령자     외국인비율      고령자비율
9    강북구  330192.0  326686.0   3506.0  54813.0  1.061806  16.600342
1    종로구  162820.0  153589.0   9231.0  25425.0  5.669451  15.615404
2     중구  133240.0  124312.0   8928.0  20764.0  6.700690  15.583909
3    용산구  244203.0  229456.0  14747.0  36231.0  6.038828  14.836427
13  서대문구  327163.0  314982.0  12181.0  48161.0  3.723221  14.720797

## 1-5 pandas 고급 기능 - 두 DataFrame 병합하기

In [568]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                    'B': ['B0', 'B1', 'B2', 'B3'],
                    'C': ['C0', 'C1', 'C2', 'C3'],
                    'D': ['D0', 'D1', 'D2', 'D3']},
                   index = [0, 1, 2, 3])

df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                    'B': ['B4', 'B5', 'B6', 'B7'],
                    'C': ['C4', 'C5', 'C6', 'C7'],
                    'D': ['D4', 'D5', 'D6', 'D7']},
                   index = [4, 5, 6, 7])

df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                    'B': ['B8', 'B9', 'B10', 'B11'],
                    'C': ['C8', 'C9', 'C10', 'C11'],
                    'D': ['D8', 'D9', 'D10', 'D11']},
                   index = [8, 9, 10, 11])

In [569]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [570]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [571]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [572]:
result = pd.concat([df1, df2, df3])
result

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [573]:
result = pd.concat([df1, df2, df3], keys=['x', 'y', 'z'])
result

        A    B    C    D
x 0    A0   B0   C0   D0
  1    A1   B1   C1   D1
  2    A2   B2   C2   D2
  3    A3   B3   C3   D3
y 4    A4   B4   C4   D4
  5    A5   B5   C5   D5
  6    A6   B6   C6   D6
  7    A7   B7   C7   D7
z 8    A8   B8   C8   D8
  9    A9   B9   C9   D9
  10  A10  B10  C10  D10
  11  A11  B11  C11  D11

In [574]:
result.index

MultiIndex(levels=[['x', 'y', 'z'], [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11]],
           labels=[[0, 0, 0, 0, 1, 1, 1, 1, 2, 2, 2, 2], [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11]])

In [575]:
df4 = pd.DataFrame({'B': ['B2', 'B3', 'B6', 'B7'],
                    'D': ['D2', 'D3', 'D6', 'D7'],
                    'F': ['F2', 'F3', 'F6', 'F7']},
                   index = [2, 3, 6, 7])
df4

    B   D   F
2  B2  D2  F2
3  B3  D3  F3
6  B6  D6  F6
7  B7  D7  F7

In [576]:
# axis=1 means concatenate with column by column
result = pd.concat([df1, df4], axis=1)
result

     A    B    C    D    B    D    F
0   A0   B0   C0   D0  NaN  NaN  NaN
1   A1   B1   C1   D1  NaN  NaN  NaN
2   A2   B2   C2   D2   B2   D2   F2
3   A3   B3   C3   D3   B3   D3   F3
6  NaN  NaN  NaN  NaN   B6   D6   F6
7  NaN  NaN  NaN  NaN   B7   D7   F7

In [577]:
# this will only concatenate with respect to the overlapping indices
result = pd.concat([df1, df4], axis=1, join='inner')
result

    A   B   C   D   B   D   F
2  A2  B2  C2  D2  B2  D2  F2
3  A3  B3  C3  D3  B3  D3  F3

In [578]:
# this method will only concatenate with respect to the indices from df1
result = pd.concat([df1, df4], axis=1, join_axes=[df1.index])
result

    A   B   C   D    B    D    F
0  A0  B0  C0  D0  NaN  NaN  NaN
1  A1  B1  C1  D1  NaN  NaN  NaN
2  A2  B2  C2  D2   B2   D2   F2
3  A3  B3  C3  D3   B3   D3   F3

In [579]:
# this will concatenate row by row, with INCREMENTED indices.
result = pd.concat([df1, df4], ignore_index=True)
result

/Users/jonghobaeck/miniconda3/lib/python3.7/site-packages/ipykernel_launcher.py:2: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

     A   B    C   D    F
0   A0  B0   C0  D0  NaN
1   A1  B1   C1  D1  NaN
2   A2  B2   C2  D2  NaN
3   A3  B3   C3  D3  NaN
4  NaN  B2  NaN  D2   F2
5  NaN  B3  NaN  D3   F3
6  NaN  B6  NaN  D6   F6
7  NaN  B7  NaN  D7   F7

### Another Example

In [580]:
left = pd.DataFrame({'key': ['K0', 'K4', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B4', 'B2', 'B3']})

right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'C': ['C0', 'C1', 'C2', 'C3'],
                     'D': ['D0', 'D4', 'D2', 'D3']})

In [581]:
left

  key   A   B
0  K0  A0  B0
1  K4  A1  B4
2  K2  A2  B2
3  K3  A3  B3

In [582]:
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D4
2  K2  C2  D2
3  K3  C3  D3

In [583]:
# merge via 'key' but this will only merge with values with overlapping keys
pd.merge(left, right, on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K2  A2  B2  C2  D2
2  K3  A3  B3  C3  D3

In [584]:
# this will merge with keys from left
pd.merge(left, right, how='left', on='key')

  key   A   B    C    D
0  K0  A0  B0   C0   D0
1  K4  A1  B4  NaN  NaN
2  K2  A2  B2   C2   D2
3  K3  A3  B3   C3   D3

In [585]:
# this will merge with keys from right
pd.merge(left, right, how='right', on='key')

  key    A    B   C   D
0  K0   A0   B0  C0  D0
1  K2   A2   B2  C2  D2
2  K3   A3   B3  C3  D3
3  K1  NaN  NaN  C1  D4

In [586]:
#very much like outer join
pd.merge(left, right, how='outer', on='key')

  key    A    B    C    D
0  K0   A0   B0   C0   D0
1  K4   A1   B4  NaN  NaN
2  K2   A2   B2   C2   D2
3  K3   A3   B3   C3   D3
4  K1  NaN  NaN   C1   D4

In [587]:
# 교집합처럼 inner join
pd.merge(left, right, how='inner', on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K2  A2  B2  C2  D2
2  K3  A3  B3  C3  D3

In [588]:
pop_seoul.head()

    구별       인구수       한국인      외국인      고령자     외국인비율      고령자비율
1  종로구  162820.0  153589.0   9231.0  25425.0  5.669451  15.615404
2   중구  133240.0  124312.0   8928.0  20764.0  6.700690  15.583909
3  용산구  244203.0  229456.0  14747.0  36231.0  6.038828  14.836427
4  성동구  311244.0  303380.0   7864.0  39997.0  2.526635  12.850689
5  광진구  372164.0  357211.0  14953.0  42214.0  4.017852  11.342849

In [589]:
cctv_seoul.head()

    구별    소계  2013년도 이전  2014년  2015년  2016년       최근증가율
0  강남구  2780       1292    430    584    932  150.619195
1  강동구   773        379     99    155    377  166.490765
2  강북구   748        369    120    138    204  125.203252
3  강서구   884        388    258    184     81  134.793814
4  관악구  1496        846    260    390    613  149.290780

### 1-6 CCTV 데이터와 인구 현황 데이터 합치고 분석하기

In [590]:
data_result = pd.merge(pop_seoul, cctv_seoul, on='구별')
data_result.head()

,구별,인구수,한국인,외국인,고령자,외국인비율,고령자비율,소계,2013년도 이전,2014년,2015년,2016년,최근증가율
0,종로구,162820.0,153589.0,9231.0,25425.0,5.669451,15.615404,1002,464,314,211,630,248.922414
1,중구,133240.0,124312.0,8928.0,20764.0,6.700690,15.583909,671,413,190,72,348,147.699758
2,용산구,244203.0,229456.0,14747.0,36231.0,6.038828,14.836427,1624,1368,218,112,398,53.216374
3,성동구,311244.0,303380.0,7864.0,39997.0,2.526635,12.850689,1062,730,91,241,265,81.780822
4,광진구,372164.0,357211.0,14953.0,42214.0,4.017852,11.342849,707,573,78,53,174,53.228621

In [591]:
del data_result['2013년도 이전']
del data_result['2014년']
del data_result['2015년']
del data_result['2016년']
data_result.head()

,구별,인구수,한국인,외국인,고령자,외국인비율,고령자비율,소계,최근증가율
0,종로구,162820.0,153589.0,9231.0,25425.0,5.669451,15.615404,1002,248.922414
1,중구,133240.0,124312.0,8928.0,20764.0,6.700690,15.583909,671,147.699758
2,용산구,244203.0,229456.0,14747.0,36231.0,6.038828,14.836427,1624,53.216374
3,성동구,311244.0,303380.0,7864.0,39997.0,2.526635,12.850689,1062,81.780822
4,광진구,372164.0,357211.0,14953.0,42214.0,4.017852,11.342849,707,53.228621

In [592]:
# setting index to '구별'
data_result.set_index('구별', inplace=True)
data_result.head()

,인구수,한국인,외국인,고령자,외국인비율,고령자비율,소계,최근증가율
구별,,,,,,,,
종로구,162820.0,153589.0,9231.0,25425.0,5.669451,15.615404,1002,248.922414
중구,133240.0,124312.0,8928.0,20764.0,6.700690,15.583909,671,147.699758
용산구,244203.0,229456.0,14747.0,36231.0,6.038828,14.836427,1624,53.216374
성동구,311244.0,303380.0,7864.0,39997.0,2.526635,12.850689,1062,81.780822
광진구,372164.0,357211.0,14953.0,42214.0,4.017852,11.342849,707,53.228621

In [593]:
#change the order of DataFrame columns
data_result = data_result[['소계', '최근증가율', '인구수', '한국인', '외국인', '고령자', '외국인비율', '고령자비율']]
data_result.head()

,소계,최근증가율,인구수,한국인,외국인,고령자,외국인비율,고령자비율
구별,,,,,,,,
종로구,1002,248.922414,162820.0,153589.0,9231.0,25425.0,5.669451,15.615404
중구,671,147.699758,133240.0,124312.0,8928.0,20764.0,6.700690,15.583909
용산구,1624,53.216374,244203.0,229456.0,14747.0,36231.0,6.038828,14.836427
성동구,1062,81.780822,311244.0,303380.0,7864.0,39997.0,2.526635,12.850689
광진구,707,53.228621,372164.0,357211.0,14953.0,42214.0,4.017852,11.342849

In [594]:
# Use corrcoef from numpy to find correlation coefficients between two variables(categories/columns within the table)
np.corrcoef(data_result['고령자비율'], data_result['소계'])

array([[ 1.        , -0.28078554],
       [-0.28078554,  1.        ]])

In [595]:
# corrcoef between 외국인비율 and 소계
np.corrcoef(data_result['외국인비율'], data_result['소계'])

array([[ 1.        , -0.13607433],
       [-0.13607433,  1.        ]])

In [596]:
# corrcoef between 인구수 and 소계
np.corrcoef(data_result['인구수'], data_result['소계'])

array([[1.        , 0.30634228],
       [0.30634228, 1.        ]])

In [598]:
data_result.sort_values(by='소계', ascending=False).head(5)

,소계,최근증가율,인구수,한국인,외국인,고령자,외국인비율,고령자비율
구별,,,,,,,,
강남구,2780,150.619195,570500.0,565550.0,4950.0,63167.0,0.867660,11.072217
양천구,2034,34.671731,479978.0,475949.0,4029.0,52975.0,0.839413,11.036964
서초구,1930,63.371266,450310.0,445994.0,4316.0,51733.0,0.958451,11.488308
은평구,1873,85.237258,494388.0,489943.0,4445.0,72334.0,0.899091,14.631019
용산구,1624,53.216374,244203.0,229456.0,14747.0,36231.0,6.038828,14.836427

##### Takeaway insight
위의 결과로 보아 소계가 높은 곳일 수록 인구수가 높은것 같다.